Repository: stefanomunarini/Level-Up
Catalog: levelup/locale/*/LC_MESSAGES/django.po
Languages: fi

source: The website in where you will use this token
fi: Verkkosivusto, jolla käytät tunnistetta

source: Unauthorized! The token you are trying to use is invalid. Format should be: Bearer <TOKEN>
fi: Pääsy estetty! Käyttämäsi tunniste on kelvoton. Sen muoto tulisi olla: Bearer <TOKEN>

source: Search
fi: Hae

source: Category
fi: Kategoria

source: Action
fi: Toiminta

source: Adventure
fi: Seikkailu

source: Kids
fi: Lapset

source: RPG
fi: Roolipelit

source: Sport
fi: Urheilu

source: Strategy
fi: Strategia

source: Game name
fi: Pelin nimi

source: Game URL slug
fi: Pelin URL-tunniste

source: Part of the game page address on LevelUp, cannot be changed later
fi: Osa pelisivun osoitetta LevelUpissa, et voi muuttaa tätä myöhemmin

source: Source URL
fi: Lähde-URL

source: Where is the game hosted?
fi: Mistä osoitteesta peli ladataan?

source: Game icon
fi: Pelin kuvake

source: Screenshot
fi: Näyttökuva

source: Buy for %(price)s €
fi: Osta summalla %(price)s €

source: Are you sure you want to remove %(game)s from the store?
fi: Oletko varma, että haluat poistaa pelin %(game)s kaupasta?

source: Remove %(game)s
fi: Poista %(game)s

source: Are you sure you want to publish %(game)s?
fi: Oletko varma, että haluat julkaista pelin %(game)s?

source: Publish %(game)s
fi: Julkaise %(game)s

source: Play
fi: Pelaa

source: Publish
fi: Julkaise

source: Free
fi: Ilmainen

source: Buy %(name)s
fi: Osta %(name)s

source: The payment will be processed by Simple Payments&trade;.
fi: Maksu suoritetaan Simple Payments&trade; -palvelussa.

source: Close dialog
fi: Sulje paneeli

source: Show sharing menu
fi: Näytä jakovalikko

source: Show developer actions menu
fi: Näytä kehittäjän toimintovalikko

source: Edit
fi: Muokkaa

source: Remove from store
fi: Poista kaupasta

source: Remove %(name)s from store
fi: Poista %(name)s kaupasta

source: Publish %(name)s
fi: Julkaise %(name)s

source: Screenshots
fi: Näyttökuvat

source: Previous screenshot
fi: Edellinen näyttökuva

source: Next screenshot
fi: Seuraava näyttökuva

source: Show %(i)s screenshot
fi: Näytä %(i)s näyttökuva

source: Global Scores
fi: Kaikki tulokset

source: Earnings
fi: Ansiot

source: Sold
fi: Myyty

source: Played
fi: Pelattu

source: Added
fi: Lisätty

source: First sale
fi: Ensimmäinen myynti

source: Player
fi: Pelaaja

source: Score
fi: Tulos

source: Date
fi: Päivämäärä

source: Create a Game
fi: Luo peli

source: Add Game
fi: Lisää peli

source: Playing
fi: Pelataan

source: My Scores
fi: Omat tulokset

source: Update
fi: Päivitä

source: Update %(name)s details
fi: Päivitä pelin %(name)s tiedot

source: Save
fi: Tallenna

source: My Games
fi: Omat pelit

source: Store
fi: Kauppa

source: Hey {}, you must buy the game before being able to play!
fi: Hei {}, sinun täytyy ostaa peli ennen kuin voit pelata!

source: You must be authenticated to perform this action!
fi: Sinun täytyy olla kirjautunut sisään tehdäksesi tämän toiminnon!

source: Games
fi: Pelit

source: Home
fi: Etusivu

source: English
fi: Englanti

source: Finnish
fi: suomi

source: Oops! Seems like you don't have permissions to access this page.
fi: Hups! Näyttää siltä, ettei sinulla ole oikeuksia päästä tälle sivulle.

source: Made with %(love)s by the LevelUp team
fi: Tehty %(love)s LevelUp -tiimin toimesta

source: Select
fi: Valitse

source: Menu
fi: Valikko

source: My Profile
fi: Profiili

source: Log Out
fi: Kirjaudu ulos

source: Log In
fi: Kirjaudu sisään

source: Sign Up
fi: Rekisteröidy

source: Pagination
fi: Sivutus

source: Previous
fi: Edellinen

source: page
fi: sivu

source: Next
fi: Seuraava

source: Log in with
fi: Kirjaudu sisään käyttäen palvelua

source: Sign In
fi: Kirjaudu sisään

source: Please sign in with one of your existing third party accounts. Or, <a href="%(signup_url)s">sign up</a> for a %(site_name)s account and sign in below:
fi: Kirjaudu sisään kolmannen osapuolen tililläsi tai <a href="%(signup_url)s">rekisteröidy %(site_name)s -palveluun</a> ja kirjaudu sisään alla:

source: or
fi: tai

source: If you have not created an account yet, then please <a href="%(signup_url)s">sign up</a> first.
fi: Jos et ole vielä luonut tiliä, <a href="%(signup_url)s">rekisteröidy</a> ensin.

source: Forgot Password?
fi: Unohtunut salasana?

source: Sign Out
fi: Kirjaudu ulos

source: Are you sure you want to sign out?
fi: Oletko varma, että haluat kirjautua ulos?

source: Change Password
fi: Vaihda salasana

source: Password Reset
fi: Nollaa salasana

source: Forgotten your password? Enter your e-mail address below, and we'll send you an e-mail allowing you to reset it.
fi: Salasana unohtunut? Kirjoita sähköpostiosoitteesi alle, niin lähetämme sinulle sähköpostiviestin, jonka avulla voit palauttaa sen.

source: Reset My Password
fi: Palauta salasanani

source: Please contact us if you have any trouble resetting your password.
fi: Ota yhteyttä, jos sinulla on ongelmia salasanan palauttamisessa.

source: We have sent you an e-mail. Please contact us if you do not receive it within a few minutes.
fi: Lähetimme sinulle sähköpostiviestin. Ota yhteyttä, jos et saa sitä muutaman minuutin kuluessa.

source: Bad Token
fi: Virheellinen tunnus

source: The password reset link was invalid, possibly because it has already been used. Please request a <a href="%(passwd_reset_url)s">new password reset</a>.
fi: Salasananpalautuslinkki oli virheellinen, koska se oli mahdollisesti jo käytetty. <a href="%(passwd_reset_url)s">Yritä salasanan palautusta uudestaan</a>.

source: change password
fi: vaihda salasana

source: Your password is now changed.
fi: Salasanasi on vaihdettu.

source: Set Password
fi: Aseta salasana

source: Signup
fi: Rekisteröityminen

source: Already have an account? Then please <a href="%(login_url)s">sign in</a>.
fi: Onko sinulla jo tili? <a href="%(login_url)s">Kirjaudu sisään</a>.

source: Signup Closed
fi: Rekisteröityminen suljettu

source: We are sorry, but the signup is currently closed.
fi: Pahoittelemme, mutta rekisteröityminen on tällä hetkellä suljettu.

source: Verify Your E-mail Address
fi: Vahvista sähköpostiosoitteesi

source: This part of the site requires us to verify that you are who you claim to be. For this purpose, we require that you verify ownership of your e-mail address.
fi: Tämä sivuston osa vaatii, että vahvistat henkilöllisyytesi. Siksi pyydämme, että vahvistat sähköpostiosoitteesi.

source: We have sent an e-mail to you for verification. Please click on the link inside this e-mail. Please contact us if you do not receive it within a few minutes.
fi: Olemme lähettäneet sinulle vahvistussähköpostin. Klikkaa saamassasi viestissä olevaa linkkiä. Ota yhteyttä, jos et saa sähköpostia muutaman minuutin kuluessa.

source: <strong>Note:</strong> you can still <a href="%(email_url)s">change your e-mail address</a>.
fi: <strong>Huom.,</strong> voit yhä <a href="%(email_url)s">vaihtaa sähköpostiosoitteesi</a>.

source: Lost password?
fi: Salasana hukassa?

source: Welcome!
fi: Tervetuloa!

source: Most Played
fi: Eniten pelatut

source: Best Sellers
fi: Myydyimmät

source: Trending this month
fi: Kuukauden suosituimmat

source: Trending this week
fi: Viikon suosituimmat

source: Social Network Login Failure
fi: Sosiaalisen verkon kirjautumisvirhe

source: An error occurred while attempting to login via your social network account.
fi: Tapahtui virhe yritettäessä kirjautua sosiaalisen verkoston tunnuksella.

source: Account Connections
fi: Liitetyt tilit

source: You can sign in to your account using any of the following third party accounts:
fi: Voit kirjautua tilillesi käyttäen jotain seuraavista kolmannen osapuolen tileistä:

source: Remove
fi: Poista

source: You currently have no social network accounts connected to this account.
fi: Sinulla ei tällä hetkellä ole sosiaalisia verkostoja liitettynä tähän tiliin.

source: Add a 3rd Party Account
fi: Lisää kolmannen osapuolen käyttäjätili

source: Login Cancelled
fi: Sisäänkirjautuminen peruutettu

source: You decided to cancel logging in to our site using one of your existing accounts. If this was a mistake, please proceed to <a href="%(login_url)s">sign in</a>.
fi: Päätit peruuttaa kirjautumisen käyttämällä olemassaolevaa tunnustasi. Jos tämä oli virhe, jatka <a href="%(login_url)s">kirjautumalla sisään</a>.

source: You are about to use your %(provider_name)s account to log in to %(site_name)s. As a final step, please complete the following form:
fi: Olet käyttämässä %(provider_name)s-palvelun tunnusta kirjautuaksesi sivulle %(site_name)s. Täytä vielä seuraava lomake:

source: Success
fi: Onnistui

source: Cancel
fi: Peruuta

source: Error
fi: Virhe

source: Congratulations %(username)s!
fi: Onnittelut, %(username)s!

source: You have just bought %(game.name)s!
fi: Olet juuri ostanut pelin %(game.name)s!

source: Start playing now!
fi: Aloita pelaaminen nyt!

source: We hope to see you soon on our platform.
fi: Toivomme näkevämme sinut pian palvelussamme.

source: The LevelUp team
fi: LevelUp-tiimi

source: Congratulations, you have bought {}!
fi: Onnittelut, olet ostanut {}!

source: Password
fi: Salasana

source: Password confirmation
fi: Vahvista salasana

source: Enter the same password as before, for verification.
fi: Kirjoita salasana uudestaan.

source: The passwords do not match.
fi: Salasanat eivät täsmää.

source: This username is already in use.
fi: Käyttäjätunnus on jo käytössä.

source: The display name you chose is already taken.
fi: Valitsemasi nimi on jo käytössä.

source: I am a developer
fi: Olen kehittäjä

source: I am a player
fi: Olen pelaaja

source: Select your role
fi: Valitse roolisi

source: Name
fi: Nimi

source: Profile picture
fi: Profiilikuva

source: URL slug
fi: URL-tunniste

source: This will be a part of the address of your public page and cannot be changed later.
fi: Tämä on osa julkisen sivusi osoitetta, etkä voi muuttaa sitä myöhemmin.

source: Developer website
fi: Kehittäjän verkkosivusto

source: Developer support email
fi: Kehittäjän tukisähköpostiosoite

source: Visible to those users that have bought your games
fi: Näkyy niille käyttäjille, jotka ovat ostaneet pelejäsi

source: Delete token
fi: Poista avain

source: Create token
fi: Luo avain

source: Last login:
fi: Viimeinen sisäänkirjautuminen:

source: Update profile
fi: Päivitä profiili

source: Send an email to the developer
fi: Lähetä sähköposti kehittäjälle

source: Visit the developer’s website
fi: Vieraile kehittäjän verkkosivustolla

source: New Developer
fi: Uusi kehittäjä

source: Sign up as a developer
fi: Rekisteröidy kehittäjänä

source: Sign up as a player
fi: Rekisteröidy pelaajana

source: New Player
fi: Uusi pelaaja

source: I’m a player!
fi: Olen pelaaja!

source: I’m a developer!
fi: Olen kehittäjä!

source: API Keys
fi: Rajapinta-avaimet

source: Statistics
fi: Tilastot

source: Token
fi: Tunnus

source: Website
fi: Verkkosivu

source: Delete
fi: Poista

source: Delete API token for %(website)s
fi: Poista rajapinta-avain sivustolle %(website)s

source: Are you sure you want to delete this token?
fi: Oletko varma, että haluat poistaa tämän tunnuksen?

source: No API keys found
fi: Rajapinta-avaimia ei löytynyt

source: Create a new API token
fi: Luo uusi rajapinta-avain

source: Sales and Profits
fi: Myynti ja tuotot

source: Update Profile
fi: Päivitä profiili

source: Sales
fi: Myynti

source: Profits
fi: Tuotot
